package org.spa.entity;

public class NumberMatrix {
    public static String[][] firstTwo = new String[][]{{ "", "0" }, { "एक", "1" }, { "दोन", "2" }, { "तिन", "3" }, { "चार", "4" }, { "पाच", "5" }, { "सहा", "6" }, { "सात", "7" }, { "आठ", "8" }, { "नऊ", "9" }, { "दहा", "10" }, 
        { "", "00" }, { "एक", "01" }, { "दोन", "02" }, { "तिन", "03" }, { "चार", "04" }, { "पाच", "05" }, { "सहा", "06" }, { "सात", "07" }, { "आठ", "08" }, { "नऊ", "09" }, { "दहा", "10" }, 
        { "एकरा", "11" }, { "बारा", "12" }, { "तेरा", "13" }, { "चौदा", "14" }, { "पंधरा", "15" }, { "सोळा", "16" }, { "सतरा", "17" }, { "अठरा", "18" }, { "एकोणविस", "19" }, { "विस", "20" }, 
        { "एकविस", "21" }, { "बाविस", "22" }, { "तेविस", "23" }, { "चोविस", "24" }, { "पंचविस", "25" }, { "सव्विस", "26" }, { "सत्ताविस", "27" }, { "अठ्ठाविस", "28" }, { "एकोणतिस", "29" }, { "तिस", "30" }, 
        { "एकतिस", "31" }, { "बत्तिस", "32" }, { "तेहतिस", "33" }, { "चौतिस", "34" }, { "पस्तीस", "35" }, { "छत्तीस", "36" }, { "सतोतीस", "37" }, { "अडोतिस", "38" }, { "एकोणचाळीस", "39" }, { "चाळीस", "40" }, 
        { "एकेचाळीस", "41" }, { "बेचाळीस", "42" }, { "त्रेचाळीस", "43" }, { "चौरेचाळीस", "44" }, { "पंचेचाळीस", "45" }, { "सेहचाळीस", "46" }, { "सत्तेचाळीस", "47" }, { "अठ्ठेचाळीस", "48" }, { "एकोणपन्नास", "49" }, { "पन्नास", "50" }, 
        { "एक्कावन", "51" }, { "बावन", "52" }, { "त्रेपन", "53" }, { "चौपन", "54" }, { "पंचावन", "55" }, { "छप्पन", "56" }, { "सत्तावन", "57" }, { "अठ्ठावन", "58" }, { "एकोनसाठ", "59" }, { "साठ", "60" }, 
        { "एकसष्ठ", "61" }, { "बासष्ठ", "62" }, { "त्रेसष्ठ", "63" }, { "चौसष्ठ", "64" }, { "पासष्ठ", "65" }, { "सहासष्ठ", "66" }, { "सदोसष्ठ", "67" }, { "अडोसष्ठ", "68" }, { "एकोनसत्तर", "69" }, { "सत्तर", "70" }, 
        { "एकाहत्तर", "71" }, { "बाहत्तर", "72" }, { "त्रेहत्तर", "73" }, { "चौरह्यात्तर", "74" }, { "पंच्याहत्तर", "75" }, { "सेहत्तर", "76" }, { "सत्याहत्तर", "77" }, { "अठ्ठ्याहत्तर", "78" }, { "एकोनएंशी", "79" }, { "एंशी", "80" }, 
        { "एक्क्यांशी", "81" }, { "ब्यांशी", "82" }, { "त्र्यांशी", "83" }, { "चौर्यांशी", "84" }, { "पंच्य़ांशी", "85" }, { "सेह्यांशी", "86" }, { "सत्त्यांशी", "87" }, { "अठ्ठ्यांशी", "88" }, { "एकोननव्वद", "89" }, { "नव्वद", "90" }, 
        { "एक्यांनव", "91" }, { "ब्यांनव", "92" }, { "त्र्यांनव", "93" }, { "चौर्यांनव", "94" }, { "पंच्यानव", "95" }, { "सेह्यांनव", "96" }, { "सत्त्यांनव", "97" }, { "अठ्ठ्यांनव", "98" }, { "नव्यांनव", "99" }, { "शंभर", "100" }};
    public static String[][] third = {{ "", "0" }, { "एकशे", "1" }, { "दोनशे", "2" }, { "तिनशे", "3" }, { "चारशे", "4" }, 
    	{ "पाचशे", "5" }, { "सहाशे", "6" }, { "सातशे", "7" }, { "आठशे", "8" }, { "नऊशे", "9" }};
}